Repository: cadwal/dumb
Catalog: po/*.po
Languages: fi

source: X server doesn't support DGA
fi: X-palvelin ei tue DGA:ta

source: using XF86-DGA
fi: XF86-DGA käytössä

source: XCreateWindow failed
fi: XCreateWindow epäonnistui

source: win-id=%ld
fi: ikkunan id=%ld

source: XShmCreateImage failed
fi: XShmCreateImage epäonnistui

source: shmget failed
fi: shmget epäonnistui

source: XShm disabled: are we not local?
fi: XShm ei toimi: eikö ollakaan samalla koneella?

source: using XShm
fi: XShm käytössä

source: XCreateImage failed
fi: XCreateImage epäonnistui

source: using Xlib Images (slow)
fi: Xlib-kuvat käytössä (hidasta)

source: X colormap came back as None. Probably some strange visual.
fi: X-värikartaksi tuli None. Jokin outo visual kai.

source: cmap-id=%ld
fi: värikartan id=%ld

source: Installing colormap
fi: Otan värikartan käyttöön

source: Got XEvent
fi: Tuli XEvent

source: Got some weird event type: %d
fi: Tuli jokin outo tapahtuma: %d

source: Got KeyPress
fi: Tuli KeyPress

source: Got KeyRelease
fi: Tuli KeyRelease

source: EnterNotify received
fi: Tuli EnterNotify

source: LeaveNotify received
fi: Tuli LeaveNotify

source: x11_input must be initialised after x11_video
fi: x11_input pitää alustaa vasta x11_videon jälkeen

source: XKB %d.%d in Xlib is incompatible with our %d.%d
fi: Xlib:n XKB %d.%d ei toimi meidän %d.%d:n kanssa

source: XKB %d.%d in X server is incompatible with our %d.%d
fi: X-palvelimen XKB %d.%d ei toimi meidän %d.%d:n kanssa

source: X server does not support DetectableAutorepeat
fi: X-palvelin ei tue DetectableAutorepeatia

source: DetectableAutorepeat enabled via XKB
fi: DetectableAutorepeat käytössä

source: keyboard grab failed!
fi: näppäimistön omiminen epäonnistui!

source: GGI: ggiInit failed.
fi: GGI: ggiInit epäonnistui.

source: GGI: ggiOpen failed.
fi: GGI: ggiOpen epäonnistui.

source: Depth %d not supported.
fi: Syvyyttä %d ei tueta.

source: Mode not supported by LibGGI.
fi: LibGGI ei tue tilaa.

source: init_video in copying mode pagelen=%d
fi: init_video kopiointitilassa pagelen=%d

source: Couldn't initialize sound: %s
fi: Äänten alustus epäonnistui: %s

source: Sound driver: %s (%s)
fi: Ääniohjain: %s (%s)

source: couldn't find SOUNDS lump
fi: SOUNDS-könttiä ei löytynyt

source: Loaded %d sounds
fi: %d ääntä ladattu

source: play_dsound got bad sound id (%d)
fi: väärä äänitunnus (%d) play_dsound:ssa

source: Sound device file to open
fi: Avattava äänilaitetiedosto

source: Maximum allowed bits per channel
fi: Montako bittiä kanavalle sallitaan

source: Force monaural sound
fi: Pakota monoääni

source: init_sound: fd=%d fragsize=%d (%d bytes)
fi: init_sound: fd=%d fragsize=%d (%d tavua)

source: init_sound: speed=%d window=%d (%f seconds) slush=%d
fi: init_sound: speed=%d window=%d (%f sekuntia) slush=%d

source: init_sound: can't get sound format list: %s
fi: init_sound: en saa listaa tuetuista äänimuodoista: %s

source: init_sound: no supported formats found
fi: init_sound: ei löytynyt yhtään tuettua muotoa

source: init_sound: set format failed: %s
fi: init_sound: muodon säätö epäonnistui: %s

source: init_sound: driver changed the format to something we don't support
fi: init_sound: ohjain vaihtoi muodon sellaiseksi, jota en tue

source: init_sound: set stereo failed: %s
fi: init_sound: stereon säätö epäonnistui: %s

source: init_sound: mono not available, using stereo
fi: init_sound: mono ei onnistu, käytetään stereota

source: init_sound: stereo not available, using mono
fi: init_sound: stereo ei onnistu, käytetään monoa

source: init_sound: set fragsize failed: %s
fi: init_sound: palan koon säätö epäonnistui: %s

source: init_sound: set speed failed: %s
fi: init_sound: taajuuden säätö epäonnistui: %s

source: init_sound: sample rate %d Hz not available, using %d Hz
fi: init_sound: taajuuden %d Hz sijasta käytössä %d Hz

source: poll_sound: underrun detected
fi: poll_sound: puskuri pääsi tyhjäksi

source: Bits per channel
fi: Bittien määrä kanavalla

source: Stereo sound instead of mono
fi: Stereoääni monon sijasta

source: init_sound: no sounddevice present
fi: init_sound: äänilaitteita ei ole

source: Failed to allocate PCMWAVEFORMAT struct
fi: PCMWAVEFORMAT-tietueen varaus epäonnistui

source: waveOutOpen failed - status = %d
fi: waveOutOpen epäonnistui - koodi = %d

source: Failed to allocate WAVEHDR struct
fi: WAVEHDR-tietueen varaus epäonnistui

source: Failed to allocate shared audio buffer
fi: Jaetun äänipuskurin varaus epäonnistui

source: init_sound: mme_handle=%d fragsize=%d (%ld bytes)
fi: init_sound: mme_handle=%d fragsize=%d (%ld tavua)

source: waveOutWrite failed
fi: waveOutWrite epäonnistui

source: wanted rot %c for sprite %s phase %d???
fi: haluttiin pyöritys %c spriten %s asennolle %d???

source: Can't find sprite %s, ph=%d (%c) rot=%c
fi: Ei löydy spriteä %s, ph=%d (%c) rot=%c

source: Can't find ThingPhase id=%d
fi: Ei löydy ThingPhasea jonka id=%d

source: sndmix_sample_size: strange format %d
fi: sndmix_sample_size: outo muoto %d

source: sndmix_play_sound: out of slots (sound discarded)
fi: sndmix_play_sound: paikat loppuivat (ääni jää soittamatta)

source: sndmix_calc_frag: strange format %d
fi: sndmix_calc_frag: outo muoto %d

source: Bad BPP value in paste_pict
fi: Kelvoton BPP-arvo paste_pict:ssä

source: Bad BPP value in paste_jpatch
fi: Kelvoton BPP-arvo paste_jpatch:ssa

source: npnames=%d (should be %d)
fi: npnames=%d (pitäisi olla %d)

source: No metatexture lumps in WAD
fi: Ei metakuviokönttejä WAD:ssa

source: %s has %d wall textures
fi: %s:ssä on %d seinäkuviota

source: Can't find any sprites in WAD
fi: WAD:sta ei löydy yhtään spriteä

source: too short sprite: %s
fi: liian lyhyt sprite: %s

source: Init %d sprites
fi: Alustettu %d spriteä

source: Bad lumpnum for texture %s in load_sprite()
fi: Kelvoton köntin numero kuviolla %s load_sprite():ssä

source: Can't find sprite texture %s
fi: Spritekuviota %s ei löydy

source: Can't find any flats in WAD
fi: WAD:sta ei löydy yhtään tasokuviota

source: funny length (%d) for flat %s
fi: outo pituus (%d) tasokuviolla %s

source: Init %d flats
fi: Alustettu %d tasokuviota

source: Can't find flat texture %s
fi: Tasokuviota %s ei löydy

source: Patchnum %d (%s) doesn't exist
fi: Osakuviota %d (%s) ei ole

source: loading patchnum %d (%s)
fi: lataan osakuvion %d (%s)

source: init_walltexs(): %d textures
fi: init_walltexs(): %d kuviota

source: Can't find wall texture %s
fi: Seinäkuviota %s ei löydy

source: wtex "%s" is unaligned with offset %ld!
fi: seinäkuvio "%s" on %ld tavua poissa kohdaltaan!

source: using one-patch kludge for %s
fi: käytän yhden osakuvion kikkaa %s:lle

source: load_walltex %s at %d bpp
fi: load_walltex %s %d bpp:llä

source: %s: %d patches
fi: %s: %d osakuviota

source: Can't make sense of patch #%d, texture %s
fi: En saa selvää osasta #%d kuviossa %s

source: %s: loaded
fi: %s: ladattu

source: found font %s already loaded
fi: kirjasinlaji %s on näköjään jo ladattu

source: Too many fonts
fi: Liikaa kirjasinlajeja

source: Loading font #%d (%s)
fi: Lataan kirjasinlajia #%d (%s)

source: Request for bad fontnum (%d)
fi: Kelvoton kirjasinlajin numero (%d)

source: Request for bad font char (%d:%d)
fi: Merkkiä ei ole kirjasinlajissa (%d:%d)

source: too many misc textures
fi: liikaa luokittelemattomia kuvioita

source: get_texture_num: unsupported texture type (%d)
fi: get_texture_num: kuvion tyyppiä %d ei tueta

source: get_texture_bynum: unsupported texture type (%d)
fi: get_texture_bynum: kuvion tyyppiä %d ei tueta

source: count_textures: unsupported texture type (%d)
fi: count_textures: kuvion tyyppiä %d ei tueta

source: init_textures(): done
fi: init_textures(): valmis

source: Strange texture type (0x%x) in free_texels
fi: Outo kuvion tyyppi (0x%x) free_texels:ssä

source: Strange BPP value (%d) in load_texels
fi: Outo BPP-arvo (%d) load_texels:ssä

source: Strange texture type (0x%x) in load_texels
fi: Outo kuvion tyyppi (0x%x) load_texels:ssä

source: Report bugs to %s.
fi: Ilmoita ohjelman vioista osoitteeseen %s.

source: `%s' is not an option. I'll use `%s' instead.
fi: "%s" ei ole vaihtoehto. Valitsen sen sijaan "%s".

source: switch requires an argument -- %s
fi: Valitsin tarvitsee argumentin -- %s

source: internal error: set_conf(): strange type %d
fi: sisäinen virhe: set_conf(): outo tyyppi %d

source: ; %s ; this file was created automatically, but you can modify it if you want
fi: ; %s ; tämä tiedosto on ohjelman tekemä, mutta voit muuttaa tätä jos haluat

source: ; Module `%s': %s
fi: ; Osa "%s": %s

source: internal error: save_conf(): strange type %d, treating as int
fi: sisäinen virhe: save_conf(): outo tyyppi %d, käsittelen kokonaislukuna

source: Missing quote in configuration file
fi: Asetustiedostosta puuttuu lainausmerkki

source: Trailing backslash in configuration file
fi: Asetustiedossa on kenoviiva rivin lopussa

source: `%s' is not a switch I recognise
fi: en tunne valitsinta "%s"

source: I don't understand your command line. The token which is causing trouble is `%s'.
fi: En ymmärrä komentoriviä. Vaikea sana on "%s".

source: usage: %s [switch [parameter]] [switch [parameter]]... For a list of all switches available, invoke %s --help all Or, for switches relating to a particular module, %s --help <module> where module is one of: all
fi: Käyttö: %s [valitsin [parametri]] [valitsin [parametri]]... Listan mahdollisista valitsimista saat käskyllä %s --help all Tai johonkin osaan liittyvistä valitsimista käskyllä %s --help <osa> missä osa on yksi näistä: all

source: For information on a particular switch: %s --help <switch>
fi: Tietoa yksittäisestä valitsimesta: %s --help <valitsin>

source: You can abbreviate `--help' as `-\?'.
fi: Voit lyhentää "--help":n "-\?":ksi.

source: Module `%s': %s
fi: Osa "%s": %s

source: <no configurable items>
fi: <ei säädettävää>

source: <integer>
fi: <kokonaisluku>

source: <enum>
fi: <valinta>

source: <string>
fi: <merkkijono>

source: <list>
fi: <luettelo>

source: <internal error: strange type %d>
fi: <sisäinen virhe: outo tyyppi %d>

source: (short form -%c)
fi: (lyhyt muoto -%c)

source: Help for %s: `%s'
fi: Osassa %s: "%s"

source: Type=%s
fi: Tyyppi=%s

source: Integer
fi: kokonaisluku

source: Default=%d
fi: Oletusarvo=%d

source: Boolean
fi: totuusarvo

source: Enumerated
fi: valinta vaihtoehdoista

source: Default=%s
fi: Oletus=%s

source: Values=
fi: Vaihtoehdot=

source: String
fi: merkkijono

source: List
fi: lista

source: Type=%d (internal error)
fi: Tyyppi=%d (sisäinen virhe)

source: Short Form=-%c
fi: Lyhyt muoto=-%c

source: Maxlen=%d
fi: Enimmäispituus=%d

source: Cannot be saved in a config file.
fi: Ei tallennu asetustiedostoon.

source: Copyright (C) %s %s
fi: Tekijänoikeus (C) %s %s

source: %s: opening log file: %s
fi: %s: lokitiedostoa avatessa: %s

source: Normal exit.
fi: Ohjelma loppui normaalisti.

source: %d errors occured.
fi: Tuli %d virhettä.

source: A fatal error occured.
fi: Tuli kohtalokas virhe.

source: System error message (may be unrelated)
fi: Järjestelmän virheilmoitus (ei ehkä liity asiaan)

source: %s: mmap %lu bytes: %s
fi: %s: mmapatessa %lu tavua: %s

source: mmap %lu bytes: %s
fi: mmapatessa %lu tavua: %s

source: %s: munmapping %lu bytes: %s
fi: %s: munmapatessa %lu tavua: %s

source: %s: seeking to %u: %s
fi: %s: siirtyessä kohtaan %u: %s

source: %s: short read (%lu<%lu): %s
fi: %s: lukeminen katkesi (%lu<%lu): %s

source: %s: short read (%d<%lu): %s
fi: %s: lukeminen katkesi (%d<%lu): %s

source: %s: opening: %s
fi: %s: avatessa: %s

source: %s: closing: %s
fi: %s: sulkiessa: %s

source: mmapping %lu zero bytes: %s
fi: mmapatessa %lu nollatavua: %s

source: %s: mmapping %lu bytes: %s
fi: %s: munmapatessa %lu tavua: %s

source: munmapping %lu bytes @ %p: %s
fi: munmapatessa %lu tavua @ %p: %s

source: out of memory reallocating %lu bytes (old=%p)
fi: muisti loppui varattaessa %lu tavua (vanhat=%p)

source: out of memory allocating %lu bytes
fi: muisti loppui varattaessa %lu tavua

source: Attempt to free NULL.
fi: Yritys vapauttaa NULL.

source: Bad lumpnum in load_lump
fi: Kelvoton köntin numero load_lump:ssa

source: a lump
fi: köntti

source: Bad lumpnum in free_lump
fi: Kelvoton köntin numero free_lump:ssa

source: wad hashtable: %d entries unused, max chain %d
fi: wad-hajotustaulukko: %d tyhjää paikkaa, pisin ketju %d

source: %s: lump %d has no name
fi: %s: köntillä %d ei ole nimeä

source: %s: lump %d is too big for wad
fi: %s: köntti %d ei mahdu wadiin

source: %s is too short to be a valid wadfile
fi: %s on liian lyhyt wad-tiedostoksi

source: %s mapped at %p (%lu bytes)
fi: %s mapattu kohtaan %p (%lu tavua)

source: Bad signature on %s: expecting %s, got %.4s
fi: %s alkaa väärin: pitäisi olla %s, on %.4s

source: directory for %s would be beyond end of file
fi: tiedoston %s sisällysluettelo ei mahdu tiedostoon

source: %s %s: %d lumps dir @ %d
fi: %s %s: %d könttiä, sisällysluettelo kohdassa %d

source: Can't find lump marker %s (lump %s)
fi: Alkumerkkiä %s ei löydy köntille %s

source: Can't find lump %s:%s
fi: Könttiä %s:%s ei löydy

source: Can't find lump %s
fi: Könttiä %s ei löydy

source: Can't find end-marker %s
fi: Loppumerkkiä %s ei löydy

source: End-marker %s occurs before lump %s
fi: Köntti %2$s on vasta loppumerkin %1$s jälkeen

source: Bad lumpnum (%x) in get_lump_*
fi: Kelvoton köntin numero (%x) jossakin get_lump_*-funktiossa

source: %s: can't open: %s
fi: %s: ei aukea: %s

source: %s: short write: %s
fi: %s: kirjoitus katkesi: %s

source: %s: can't rewind: %s
fi: %s: ei pääse takaisin alkuun: %s

source: %s: can't get position: %s
fi: %s: ei saa paikkaa selville: %s

source: %s: can't align: %s
fi: %s: ei voi kohdistaa: %s

source: deleting sector %u which has sides
fi: tuhottavalla sektorilla %u on kylkiä

source: sector deleted under thing %d
fi: tuhottiin sektori, jossa olio %d oli

source: Saving level %s to %s
fi: Tallennan kenttää %s tiedostoon %s

source: %s: option `%s' is ambiguous
fi: %s: valitsin "%s" on epäselvä

source: %s: option `--%s' doesn't allow an argument
fi: %s: valitsin "--%s" ei salli argumenttia

source: %s: option `%c%s' doesn't allow an argument
fi: %s: valitsin "%c%s" ei salli argumenttia

source: %s: option `%s' requires an argument
fi: %s: valitsin "%s" tarvitsee argumentin

source: %s: unrecognized option `--%s'
fi: %s: tuntematon valitsin "--%s"

source: %s: unrecognized option `%c%s'
fi: %s: tuntematon valitsin "%c%s"

source: %s: illegal option -- %c
fi: %s: virheellinen valitsin -- %c

source: %s: invalid option -- %c
fi: %s: virheellinen valitsin -- %c

source: %s: option requires an argument -- %c
fi: %s: valitsin tarvitsee argumentin -- %c

source: %s: option `-W %s' is ambiguous
fi: %s: valitsin "-W %s" on epäselvä

source: %s: option `-W %s' doesn't allow an argument
fi: %s: valitsin "-W %s" ei salli argumenttia

source: name expected after AnimTex
fi: AnimTex-sanan jälkeen pitää olla nimi

source: To must exceed Parm
fi: To:n pitää olla suurempi kuin Parm

source: Tag must come before any Texture
fi: Tag pitää olla ennen Textureja

source: %5d animtexes
fi: %5d kuvioanimaatiota (ANIMTEX)

source: name expected after Gettable
fi: Gettable-sanan jälkeen pitää olla nimi

source: %5d gettables
fi: %5d kerättävää (GETTABLE)

source: gettable name parameter expected
fi: kerättävän (Gettable) nimi puuttuu

source: gettable name unrecognised
fi: tätä kerättävää ei ole määritelty

source: name expected after Level
fi: Level-sanan jälkeen pitää olla nimi

source: %5d levinfos
fi: %5d kenttää (LEVINFO)

source: unrecognised levelname: %s
fi: kenttää %s ei ole määritelty

source: name expected after Line/SectorType
fi: LineType- ja SectorType-sanan jälkeen pitää olla nimi

source: ID expected after Line/SectorType
fi: LineType ja SectorType tarvitsevat ID:n

source: ID %d (%s) not unique (clashes with %s)
fi: ID %d (%s) on jo käytössä (%s)

source: too many actions
fi: liikaa toimintoja

source: lumptype expected after Action
fi: Action-sanan jälkeen pitää olla könttityyppi

source: eventtype expected after Action
fi: Action-sanan ja könttityypin jälkeen pitää olla tapahtumatyyppi

source: %5d linetypes
fi: %5d seinätyyppiä (LINETYPE)

source: %5d sectortypes
fi: %5d sektorityyppiä (SECTTYPE)

source: termtype parameter expected
fi: tarvitaan kohdetyyppi

source: strange lumptype
fi: outo könttityyppi

source: strange eventtype
fi: outo tapahtumatyyppi

source: eventtype expected after WaitFor
fi: WaitFor-sanan jälkeen pitää olla tapahtumatyyppi

source: string parameter expected
fi: tarvitaan merkkijonoparametri

source: character parameter expected
fi: tarvitaan merkkiparametri

source: integer parameter expected
fi: tarvitaan kokonaislukuparametri

source: floating-point parameter expected
fi: tarvitaan desimaalilukuparametri

source: time parameter expected
fi: tarvitaan aikaparametri

source: speed parameter expected
fi: tarvitaan nopeusparametri

source: arc parameter expected
fi: tarvitaan kulmaparametri

source: strange timing unit
fi: outo aikayksikkö

source: strange speed unit
fi: outo nopeusyksikkö

source: strange arc unit
fi: outo kulmayksikkö

source: name expected after PhaseTable
fi: PhaseTable-sanan jälkeen pitää olla nimi

source: %5d phase tables
fi: %5d tilataulukkoa (PHASES)

source: phase table name parameter expected
fi: tarvitaan tilataulukon nimi

source: phase table name unrecognised
fi: tätä tilataulukkoa ei ole määritelty

source: you need to specify a phasetable first
fi: valitse ensin taulukko, johon tämä tila kuuluu

source: phase name parameter expected
fi: tarvitaan tilan nimi

source: phase name unrecognised
fi: tätä tilaa ei ole määritelty

source: name expected after Proto
fi: Proto-sanan jälkeen pitää olla nimi

source: %5d protos: sorting
fi: %5d protoa (PROTOS): lajittelen

source: , writing
fi: , tallennan

source: warning: proto %s (%d) has no phasetable
fi: varoitus: protolla %s (%d) ei ole tilataulukkoa

source: proto name parameter expected
fi: tarvitaan proton nimi

source: proto name unrecognised
fi: tätä protoa ei ole määritelty

source: ID %d not unique (clashes with %s)
fi: ID %d on jo käytössä (%s)

source: Usage: %s -d DIRECTORY Compile .pt files to various lumps used by DUMB. Ptcomp reads .pt source from standard input, and creates the following files in DIRECTORY: PHASES.lump, PROTOS.lump, GETTABLE.lump, LINETYPE.lump, SECTTYPE.lump, SOUNDS.lump, ANIMTEX.lump and LEVINFO.lump.
fi: Käyttö: %s -d HAKEMISTO Kääntää .pt-tiedostoja kaikenlaisiksi DUMB:n käyttämiksi könteiksi. Ptcomp lukee .pt-lähdekoodia vakiosyötteestä ja tekee HAKEMISTOON seuraavat tiedostot: PHASES.lump, PROTOS.lump, GETTABLE.lump, LINETYPE.lump, SECTTYPE.lump, SOUNDS.lump, ANIMTEX.lump ja LEVINFO.lump.

source: -d, --output-directory=DIRECTORY write the output files to DIRECTORY --help display this help and exit --version output version information and exit
fi: -d, --output-directory=HAKEMISTO tallenna tulostiedostot HAKEMISTOON --help näytä tämä ohje ja lopeta --version näytä versiotiedot ja lopeta

source: %s: Deprecated usage. Assuming you meant:
fi: %s: Vanhentunut käyttötapa. Tee mieluummin näin:

source: Try `%s --help' for more information.
fi: Lisätietoja saat komennolla "%s --help".

source: %s: You must use `-o DIRECTORY'
fi: %s: Määrää kohdehakemisto valitsimella -o

source: stdin
fi: standardisyöte

source: %s: compiling...
fi: %s: käännän...

source: %s: writing...
fi: %s: tallennan...

source: name expected after SoundType
fi: SoundType-sanan jälkeen pitää olla nimi

source: too many sound redirects
fi: liikaa sijaisääniä

source: %5d sounds
fi: %5d ääntä (SOUNDS)

source: sound name parameter expected
fi: tarvitaan äänen nimi

source: soundtype redefined
fi: ääni on jo määritelty

source: syntax error near token `%s'
fi: virhe kohdan "%s" lähellä

source: fatal error
fi: vakava virhe

source: %s: invalid integer `%s'
fi: %s: virheellinen kokonaisluku "%s"

source: %s: integer `%s' is too large
fi: %s: luku "%s" ei ole sallituissa rajoissa

source: Usage: %s [--seed=INTEGER] Test how fast your machine can add, multiply and divide random numbers in fixed and floating point.
fi: Käyttö: %s [--seed=SIEMEN] Kokeilee, kuinka nopeasti koneesi ynnää, kertoo ja jakaa satunnaislukuja kiinteällä ja liukuvalla pilkulla.

source: -s, --seed=INTEGER seed for random number generator --help display this help and exit --version output version information and exit
fi: -s, --seed=KOKONAISLUKU Satunnaislukugeneraattoriin siemenluku --help näytä tämä ohje ja lopeta --version näytä versiotiedot ja lopeta

source: %s: Non-option arguments are not allowed
fi: %s: Komentorivillä ei saa olla muuta kuin valitsimia

source: Adding random numbers...
fi: Satunnaislukujen yhteenlasku...

source: Fixed: %d
fi: Kiinto: %d

source: Float: %d
fi: Liuku: %d

source: Multiplying random numbers...
fi: Satunnaislukujen kertolasku...

source: Dividing random numbers...
fi: Satunnaislukujen jakolasku...

source: %s: initializing map
fi: %s: alustan karttaa

source: %s: setting difficulty
fi: %s: asetan vaikeusastetta

source: Usage: %s [OPTION]... IWAD [PWAD]... Load a map and operate on it.
fi: Käyttö: %s [VALITSIN]... IWAD [PWAD]... Lataa kartta ja käsittele sitä.

source: Settings: -m, --map=NAME which map to load (default %s) --difficulty=N 1=easy ... 5=hard (default all) --verbose explain what is being done
fi: Asetukset: -m, --map=NIMI lataa tämä kartta (oletus: %s) --difficulty=N vaikeusaste, 1=helppo...5=vaikea (oletus: kaikki) --verbose selitä mitä tapahtuu

source: Operations: --statistics display statistics on the whole map --sector-sides=SECTOR list sides in SECTOR --sector-things=SECTOR list things in SECTOR --thing-sectors=THING list sectors THING is in --set-name=NAME set the name of the map to NAME --set-long-name=NAME set the long name of the map to NAME --output-doom=FILE save the map to FILE in Doom format. .wad won't be appended automatically.
fi: Toiminnot: --statistics näytä tilastoja koko kartasta --sector-sides=SEKTORI listaa SEKTORIN kyljet --sector-things=SEKTORI listaa SEKTORISSA olevat oliot --thing-sectors=OLIO listaa sektorit, joissa OLIO on --set-name=NIMI aseta kartan nimi --set-long-name=NIMI aseta kartan pitkä nimi --output-doom=TIEDOSTO tallenna kartta TIEDOSTOON Doom-muodossa. Ei lisää automaattisesti perään .wad-päätettä.

source: Other: --help display this help and exit --version output version information and exit
fi: Muuta: --help näytä tämä ohje ja lopeta --version näytä versiotiedot ja lopeta

source: %s: --difficulty given twice
fi: %s: annoit --difficulty-valitsimen kahdesti

source: %s: invalid difficulty `%s'
fi: %s: vaikeusaste "%s" ei kelpaa

source: %s: difficulty must be between 1 and 5
fi: %s: vaikeusasteen pitää olla välillä 1-5

source: %s: invalid sector number `%s'
fi: %s: sektorin numero "%s" ei kelpaa

source: %s: invalid thing number `%s'
fi: %s: olion numero "%s" ei kelpaa

source: %s: opening files
fi: %s: avaan tiedostoja

source: %s: missing IWAD argument
fi: %s: IWAD-tiedoston nimi puuttuu

source: Statistics for level %s:
fi: Tilastotietoja kentästä %s:

source: Vertices:
fi: Nurkkapisteitä:

source: Sectors:
fi: Sektoreita:

source: Sides:
fi: Kylkiä:

source: Lines:
fi: Janoja:

source: Things:
fi: Olioita:

source: %u alloced, %u inited, %u free
fi: %u varattu, %u käytetty, %u vapaana

source: %s: sector number %d doesn't exist
fi: %s: sektoria numero %d ei ole olemassa

source: Sides in sector %d:
fi: Sektorin %d kyljet:

source: side %5d, line %5d
fi: kylki %5d, jana %5d

source: side %5d, line %5d, opposite sector %5d
fi: kylki %5d, jana %5d, takana sektori %5d

source: Things in sector %d:
fi: Oliot sektorissa %d:

source: %s: thing number %d doesn't exist
fi: %s: oliota numero %d ei ole olemassa

source: Sectors thing %d is in:
fi: Sektorit, joissa olio %d on:

source: %s: You must use `--min=BRIGHTNESS'
fi: %s: Valitsin "--min=KIRKKAUS" on pakollinen.
