Repository: cadwal/dumb
Catalog: po/*.po
Languages: fi

source: ticks to pass before key autorelease or 0
fi: kuinka pian näppäin oletetaan löysätyksi tai 0

source: ticks to pass before shift autorelease or 0
fi: kuinka pian vaihtonäppäin oletetaan löysätyksi tai 0

source: aalib_input must be initialised after aalib_video
fi: aalib_input pitää alustaa aalib_videon jälkeen

source: AA-lib keyboard driver supports AA_SENDRELEASE
fi: AA-libin näppäimistöohjain tukee AA_SENDRELEASEa

source: AA-lib keyboard driver doesn't support AA_SENDRELEASE
fi: AA-libin näppäimistöohjain ei tue AA_SENDRELEASEa

source: very fast (but not as perfect)
fi: hyvin nopea (muttei yhtä täydellinen)

source: <disabled at compile time>
fi: <poistettu käytöstä käännösaikana>

source: brightness (0-255)
fi: kirkkaus (0-255)

source: contrast (0-255)
fi: kontrasti (0-255)

source: gamma (1000 corresponds to 1.0)
fi: gamma (1000 vastaa 1.0:aa)

source: multiply factor for dim color (ditto)
fi: kerroin tummalle värille (samoin)

source: multiply factor for bold color (ditto)
fi: kerroin kirkkaalle värille (samoin)

source: dithering type
fi: rasterointitapa

source: range of random value to add to each pixel (0-inf)
fi: joka pikseliin lisättävän satunnaisluvun raja (0-ääretön)

source: invert the whole screen
fi: vaihda musta ja valkoinen koko kuvassa

source: name of the font you use
fi: käyttämäsi kirjasinlajin nimi

source: use the normal attribute
fi: käytä tavallisen värisiä merkkejä

source: use the bold (double bright) attribute
fi: käytä kirkkaita merkkejä

source: use the boldfont attribute
fi: käytä lihavoituja merkkejä

source: use the dim (half bright) attribute
fi: käytä himmeitä merkkejä

source: use the reverse attribute
fi: käytä käänteisiä merkkejä

source: use all 256 characters
fi: käytä kaikkia 256 merkkiä

source: use eight-bit ASCII
fi: käytä 8-bittistä ASCII:ta

source: AA-lib initialisation failed
fi: AA-libin alustus epäonnistui

source: AA-lib doesn't know of font `%s'
fi: AA-lib ei tunne kirjasinlajia "%s"

source: The following fonts are available:
fi: Nämä kirjasinlajit ovat tarjolla:

source: Bad AnimTexNum (%d)
fi: Kelvoton AnimTexNum (%d)

source: too many banners
fi: liikaa liukuvia tekstejä

source: init banner %d
fi: liukuteksti %d alustettu

source: Quit
fi: Lopeta

source: Move forward
fi: Liiku eteenpäin

source: Move backward
fi: Liiku taaksepäin

source: Turn left
fi: Käänny vasemmalle

source: Turn right
fi: Käänny oikealle

source: Turn around
fi: Käänny ympäri

source: Sidestep left
fi: Liiku sivuttain vasemmalle

source: Sidestep right
fi: Liiku sivuttain oikealle

source: Jump / Swim/Fly up
fi: Hyppää / ui/lennä ylös

source: Duck / Swim/Fly down
fi: Kyyristy / sukella/lennä alas

source: Look up
fi: Katso ylös

source: Look down
fi: Katso alas

source: Aim up
fi: Tähtää ylös

source: Aim down
fi: Tähtää alas

source: Center view
fi: Katso suoraan eteenpäin

source: Run
fi: Juokse

source: Strafe
fi: Liiku sivuttain

source: Activate
fi: Kopeloi

source: Shoot
fi: Ammu

source: Shoot special
fi: Ammu erikoisammus

source: Select next weapon
fi: Valitse seuraava ase

source: Select previous weapon
fi: Valitse edellinen ase

source: Select weapon 0
fi: Valitse ase 0

source: Select weapon 1
fi: Valitse ase 1

source: Select weapon 2
fi: Valitse ase 2

source: Select weapon 3
fi: Valitse ase 3

source: Select weapon 4
fi: Valitse ase 4

source: Select weapon 5
fi: Valitse ase 5

source: Select weapon 6
fi: Valitse ase 6

source: Select weapon 7
fi: Valitse ase 7

source: Select weapon 8
fi: Valitse ase 8

source: Select weapon 9
fi: Valitse ase 9

source: Use item
fi: Käytä esinettä

source: Next item
fi: Seuraava esine

source: Previous item
fi: Edellinen esine

source: disable mouse support
fi: älä käytä hiirtä

source: mouse sensitivity x-axis (4)
fi: hiiren herkkyys x-suunnassa (4)

source: mouse sensitivity y-axis (2)
fi: hiiren herkkyys y-suunnassa (2)

source: Can't initialize mouse! Missing driver?
fi: En voi alustaa hiirtä! Puuttuuko ohjain?

source: dont try to use page flipping
fi: älä yritä vaihdella näyttösivuja

source: use VESA 2.0 linear modes (UniVBE preferred)
fi: käytä VESA 2.0:n lineaaritiloja (UniVBE on hyvä)

source: Can't initialize video: %s
fi: En voi alustaa näyttöä: %s

source: Using page flipping
fi: Vaihtelen näyttösivuja

source: Using double buffering
fi: Kaksoispuskurointi käytössä

source: Using two-stage double buffering
fi: Kaksivaiheinen kaksoispuskurointi käytössä

source: Video mode: %s (%s)
fi: Näyttötila: %s (%s)

source: got SIGALRM: renderer must have gotten stuck...
fi: tuli SIGALRM: piirto-osa taisi jäädä jumiin...

source: save configuration after every run
fi: tallenna asetukset joka kerta

source: save configuration this time only
fi: tallenna asetukset vain tällä kertaa

source: specify wadfiles to load
fi: lataa nämä wad-tiedostot

source: directories in which to look for wads
fi: mistä hakemistoista wadeja etsitään

source: filename of doom.wad
fi: doom.wad-tiedoston nimi

source: filename of doom2.wad
fi: doom2.wad-tiedoston nimi

source: filename of doom4dum.wad
fi: doom4dum.wad-tiedoston nimi

source: set starting map
fi: ensimmäisen kentän nimi

source: don't log to the screen
fi: älä tulostele lokeja näytölle

source: don't create any objects, just preview the map
fi: älä tee olioita, näytä vain kartta

source: set difficulty level
fi: vaikeustaso

source: disable sound
fi: äänet pois

source: video width
fi: kuvan leveys

source: video height
fi: kuvan korkeus

source: video depth (in bytes/pixel)
fi: kuvan syvyys (tavuina/pikseli)

source: log to this file
fi: tee loki tähän tiedostoon

source: record player actions to file
fi: tallenna pelaajan liikkeet tiedostoon

source: playback player actions from file
fi: toista pelaajan liikkeet tiedostosta

source: hide gettables and banners
fi: piilota esineet ja tekstit

source: show a crosshair in the center of the view
fi: näytä tähtäin keskellä ruutua

source: multiply the pixels x size
fi: venytä pikseleitä x-suunnassa

source: multiply the pixels y size
fi: venytä pikseleitä y-suunnassa

source: skip pixels when multiplying x size
fi: hypi pikselien yli x-suunnassa

source: skip pixels when multiplying y size
fi: hypi pikselien yli y-suunnassa

source: load textures before game starts
fi: lataa kuviot ennen pelin alkua

source: angle from forward of player view
fi: katselusuunta, 0=eteenpäin

source: offset from center of player view
fi: katselupisteen etäisyys pelaajasta

source: network play: slave mode
fi: verkkopeli: ole orja

source: network play: master mode
fi: verkkopeli: ole isäntä

source: force single player mode
fi: pakota yksinpeli

source: angle to rotate view by
fi: katselusuunnan pyörimisnopeus

source: maximum frames to render
fi: montako framea enintään piirretään

source: enable 3rd person perspective
fi: ulkoinen kuvakulma

source: Input Driver
fi: Ohjaus

source: Video Driver
fi: Näyttö

source: Sound Driver
fi: Ääniohjain

source: Network Driver
fi: Verkko

source: Network Play
fi: Verkkopeli

source: General Game Control
fi: Pelin yleiset säädöt

source: Player Interface
fi: Pelihahmon ominaisuudet

source: Keyboard Mapping
fi: Näppäinten määrittely

source: This program is free software; you may redistribute it under the terms of the GNU General Public License. This program has absolutely no warranty.
fi: Tämä on vapaa ohjelma; saat levittää sitä GNU General Public License -sopimuksen mukaan. Tällä ohjelmalla ei ole minkäänlaista takuuta.

source: Preloading wall textures
fi: Lataan seinäkuvioita ennakkoon

source: Preloading floor/ceiling textures
fi: Lataan katto- ja lattiakuvioita ennakkoon

source: Preloading sprites
fi: Lataan spritejä ennakkoon

source: This program was compiled to use MMX, but your processor does not appear to support it.
fi: Tämä ohjelma on käännetty käyttämään MMX:ää, mutta prosessorisi ei näköjään tue sitä.

source: Read configuration from %s
fi: Asetukset ladattu tiedostosta %s

source: network mode: slave
fi: verkkopeli: orja

source: network mode: master
fi: verkkopeli: isäntä

source: Unsupported BPP=%d
fi: BPP:tä %d ei tueta

source: Can't find sector for player
fi: Pelaajan sektoria ei löydy

source: starting game
fi: peli alkaa

source: Demo ran out...
fi: Demo loppui...

source: saving snapshot...
fi: tallennan kuvaa...

source: snapshot done
fi: kuva tallennettu

source: %d ticks passed with MAXTICKS=%d
fi: %d hetkeä kului ja MAXTICKS=%d

source: WARNING: this system is running faster than the timer resolution
fi: VAROITUS: tämä kone toimii nopeammin kuin ajastin ehtii mitata

source: Try running DUMB in a larger window.
fi: Kokeile ajaa DUMBia isommassa ikkunassa.

source: YOU DIED. TOO BAD...
fi: KUOLIT. VOI HARMI...

source: %d frames, %d seconds, %f fps
fi: %d framea, %d sekuntia, %f fps

source: Saving config to %s
fi: Tallennan asetuksia tiedostoon %s

source: dummy input: always quit
fi: muka-ohjaus: lopeta heti

source: processor timing overcompensation tweak
fi: prosessorin nopeuden yliarvointikikka

source: forward speed
fi: nopeus eteenpäin

source: strafe speed
fi: nopeus sivulle

source: turning speed
fi: kääntymisnopeus

source: jumping speed
fi: hyppynopeus

source: PLAYER %d WARPED
fi: PELAAJA %d VARPPASI

source: PLAYER %d CHEATED
fi: PELAAJA %d HUIJASI

source: PLAYER %d WIBBLED LOUDLY
fi: PELAAJA %d UIKUTTI KUULUVASTI

source: PLAYER %d RETURNED
fi: PELAAJA %d PALASI

source: PLAYER %d SMASHES PUMPKINS
fi: PELAAJA %d MURSKAA KURPITSOJA

source: Strange gettable type=%d num=%d
fi: Outo kerättävä tyyppi=%d määrä=%d

source: THAT %s WOULD BE WASTED...
fi: SE %s MENISI HUKKAAN...

source: init %d gettables
fi: alustetaan %d kerättävää

source: NULL keyname for keycode 0x%08lX
fi: NULL-nimi näppäinkoodille 0x%08lX

source: No action for keyname "%s"
fi: Ei toimintoa näppäimelle "%s"

source: --- begin keymap debug dump
fi: --- näppäinkartan koetuloste alkaa

source: --- end keymap debug dump
fi: --- näppäinkartan koetuloste loppuu

source: attempt to resize keymap under its length
fi: yritys kutistaa näppäinkartta alle pituutensa

source: Keys to quit DUMB
fi: Näppäimet joilla poistutaan DUMB:sta

source: Keys to move forward
fi: Näppäimet joilla liikutaan eteenpäin

source: Keys to move backward
fi: Näppäimet joilla liikutaan taaksepäin

source: Keys to turn left
fi: Näppäimet joilla käännytään vasemmalle

source: Keys to turn right
fi: Näppäimet joilla käännytään oikealle

source: (not implemented)
fi: (ei toimi vielä)

source: Keys to sidestep left
fi: Näppäimet joilla liikutaan vasemmalle

source: Keys to sidestep right
fi: Näppäimet joilla liikutaan oikealle

source: Keys to jump / swim/fly up
fi: Näppäimet joilla hypätään / uidaan/lennetään ylös

source: Keys to duck / swim/fly down
fi: Näppäimet joilla kyyristytään / sukelletaan/syöksytään alas

source: Keys to look up
fi: Näppäimet joilla katsotaan ylös

source: Keys to look down
fi: Näppäimet joilla katsotaan alas

source: Keys to aim up
fi: Näppäimet joilla tähdätään ylös

source: Keys to aim down
fi: Näppäimet joilla tähdätään alas

source: Keys to look straight ahead
fi: Näppäimet joilla katsotaan suoraan eteenpäin

source: Keys to hold to move faster
fi: Näppäimet joita painamalla liikutaan nopeammin

source: Keys to hold to sidestep instead of turning
fi: Näppäimet joita painamalla astellaan sivuttain eikä käännytä

source: Keys to activate switches and doors
fi: Näppäimet joilla käännetään kytkimiä ja avataan ovia

source: Keys to shoot with the selected weapon
fi: Näppäimet joilla ammutaan valitulla aseella

source: Keys to select the next weapon
fi: Näppäimet joilla valitaan seuraava ase

source: Keys to select the previous weapon
fi: Näppäimet joilla valitaan edellinen ase

source: Keys to select weapon 0
fi: Näppäimet joilla valitaan ase 0

source: Keys to select weapon 1
fi: Näppäimet joilla valitaan ase 1

source: Keys to select weapon 2
fi: Näppäimet joilla valitaan ase 2

source: Keys to select weapon 3
fi: Näppäimet joilla valitaan ase 3

source: Keys to select weapon 4
fi: Näppäimet joilla valitaan ase 4

source: Keys to select weapon 5
fi: Näppäimet joilla valitaan ase 5

source: Keys to select weapon 6
fi: Näppäimet joilla valitaan ase 6

source: Keys to select weapon 7
fi: Näppäimet joilla valitaan ase 7

source: Keys to select weapon 8
fi: Näppäimet joilla valitaan ase 8

source: Keys to select weapon 9
fi: Näppäimet joilla valitaan ase 9

source: Keys to use the selected item
fi: Näppäimet joilla käytetään valittua esinettä

source: Keys to select the next item
fi: Näppäimet joilla valitaan seuraava esine

source: Keys to select the previous item
fi: Näppäimet joilla valitaan edellinen esine

source: Keymap is empty, installing defaults.
fi: Näppäinkartta on tyhjä. Otan käyttöön oletukset.

source: Loading %s: difficulty=%d
fi: Lataan kenttää %s: vaikeustaso=%d

source: Loading %s grain=%d align=%d
fi: Lataan könttiä %s: raekoko=%d kohdistus=%d

source: levdata: %s will not be aligned correctly
fi: levdata: %s ei kohdistu oikein

source: Init %d %s
fi: Alustan %d %s-raetta

source: Uh-oh: no player!
fi: Uhhuh: ei pelaajaa!

source: Freeing level data for %s
fi: Poistan kenttää %s muistista

source: Pre-freeing %s for %s
fi: Poistan kentän %2$s %1$s-könttiä muistista

source: bad maplumptype (%d) in apply_update()
fi: kelvoton karttakönttityyppi (%d) apply_update():ssa

source: no decode func for maplumptype %d
fi: ei dekoodausfunktiota karttakönttityypille %d

source: out of range item (%d) in apply_update()
fi: mahdoton indeksi (%d) apply_update():ssa

source: got plinfo_update for player with no plinfo?
fi: tuli plinfo_update pelaajalta jolla ei ole plinfoa?

source: Ran out of thing slots
fi: Esinepaikat loppuivat kesken

source: Couldn't find protothing ID=%d
fi: Ei löytynyt protothingiä, jonka ID=%d

source: diffchk: strange difficulty??? (%d)
fi: diffchk: outo vaikeustaso??? (%d)

source: warning: no LEVINFO lump for this game
fi: varoitus: pelille ei ole LEVINFO-könttiä

source: Init %d levels
fi: Alustettu %d kenttää

source: bogus levinfo pointer in levinfo_load
fi: virheellinen levinfo-osoitin levinfo_load:ssa

source: no levinfo for %s, so can't find next level
fi: ei levinfoa %s:lle, joten seuraavasta kentästä ei ole tietoa

source: Loaded %d linetypes, of which %d scrolling
fi: Ladattu %d seinätyyppiä, joista %d vierii

source: Failed to find LINETYPE in wad
fi: WAD:sta ei löytynyt LINETYPE-könttiä

source: Loaded %d sectortypes
fi: Ladattu %d sektorityyppiä

source: Failed to find SECTTYPE in wad
fi: WAD:sta ei löytynyt SECTTYPE-könttiä

source: mouse type
fi: hiiren tyyppi

source: mouse device
fi: hiirilaite

source: Console open failed
fi: Konsolin avaus epäonnistui

source: Console in raw mode
fi: Konsoli raakatilassa

source: maximum pages to use for flipping
fi: montako näyttösivua enintään vaihdellaan

source: minimum pages to use for flipping
fi: montako näyttösivua vähintään vaihdellaan

source: Bad BPP (%d) in init_video
fi: Kelvoton BPP (%d) init_video:ssa

source: No linear framebuf? Try running as root (not just suid root)
fi: Ei lineaarista näyttöpuskuria? Kokeile ajaa roottina (eikä vain suid roottina)

source: Too little video RAM, or no linear fb: linearlen=%d pagelen=%d
fi: Liian vähän näyttömuistia tai ei lineaarista näyttöpuskuria: linearlen=%d pagelen=%d

source: init_video in copying mode linearlen=%d pagelen=%d npages=%d
fi: init_video kopiointitilassa linearlen=%d pagelen=%d npages=%d

source: init_video in flipping mode linearlen=%d pagelen=%d npages=%d
fi: init_video vaihtelutilassa linearlen=%d pagelen=%d npages=%d

source: too many stations
fi: liikaa asemia verkossa

source: network driver doesn't know how to gethostname()?
fi: verkko-ohjain ei osaa gethostnamea?

source: packet length not a multiple of 4 (type=%c len=%lu)
fi: paketin pituus ei ole jaollinen 4:llä (tyyppi=%c pituus=%lu)

source: msec to wait for slaves to init
fi: montako ms odotetaan orjien käynnistymistä

source: msec to wait for slaves to catch up
fi: montako ms odotetaan orjien pääsevän tahtiin

source: msec to wait for master
fi: montako ms odotetaan isäntää

source: msec to allow slaves to get behind
fi: montako ms orjien annetaan jäädä jälkeen

source: run network asychronously
fi: älä tahdista ollenkaan

source: time between sending acks
fi: aika kuittausten lähettämisen välillä

source: sending slave-init to %s (station %d)
fi: lähetän orjan alustusta %s:lle (asema %d)

source: sending slave-init packets...
fi: lähetän orjanalustuspaketteja...

source: waiting for slaves to initialise
fi: odotan orjien käynnistymistä

source: all slaves up
fi: kaikki orjat käynnissä

source: sending init-request
fi: lähetän alustuspyyntöä

source: waiting for slave init info from master
fi: odotan orjanalustustietoja isännältä

source: waiting for slave '%s' (%d) to catch up
fi: odotan että orja "%s" (%d) pääsee tahtiin

source: slave '%s' (%d) seems to be dead
fi: orja "%s" (%d) vaikuttaa kuolleelta

source: inconsistent packet length %lu > %lu
fi: paketin pituus ei täsmää (%lu > %lu)

source: init request from %s ignored
fi: alustuspyyntö asemalta %s hylätty

source: got init request: setting up new station %d
fi: tuli alustuspyyntö: valmistelen uuden aseman %d

source: init pkt length mismatch: got %d, expecting %lu
fi: alustuspaketin pituus ei täsmää: tuli %d, pitäisi olla %lu

source: protocol version mismatch: got %d, expecting %d
fi: protokollan versio ei täsmää: tuli %d, pitäisi olla %d

source: strange packet type (%c) in netplay_poll()
fi: outo paketin tyyppi (%c) netplay_poll():ssa

source: station %s (%d) lives!
fi: asema %s (%d) on elossa!

source: start=%d end=%d
fi: alku=%d loppu=%d

source: problems with fb coords in draw_wall_segment
fi: fb-koordinaattiongelmia draw_wall_segment:ssä

source: problems with fb coords in draw_sky_segment
fi: fb-koordinaattiongelmia draw_sky_segment:ssä

source: problems with fb coords in draw_obj
fi: fb-koordinaattiongelmia draw_obj:ssa

source: Column (%d) off edge of sprite (width=%d)
fi: Saraketta (%d) ei ole spritessä (leveys=%d)

source: init_renderer fb dimensions (%d,%d) view (%d,%d) bpp=%d
fi: init_renderer: näyttöpuskurin mitat (%d,%d) kuva (%d,%d) bpp=%d

source: fb1=%d fb2=%d for wall %d
fi: seinällä %3$d on fb1=%1$d ja fb2=%2$d

source: Too many wall start_events column=%d
fi: Liikaa seinänalkuja sarakkeessa %d

source: Too many obj start_events
fi: Liikaa spritenalkuja

source: active_count=%d at rw_column %d
fi: active_count=%d kun rw_column=%d

source: active_obj_count=%d at rw_column %d
fi: active_obj_count=%d kun rw_column=%d

source: Too many active objects (%d)
fi: Liikaa aktiivisia spritejä (%d)

source: unimplemented LT_TermType %d
fi: tuntematon LT_TermType %d

source: find_spot: found %d
fi: find_spot: löytyi %d

source: find_spot: no spot found
fi: find_spot: ei löytynyt

source: boss tag effect on sector %d
fi: pääpahan kuolinvaikutus sektorilla %d

source: strange WallHitType (%d) in thing_hit_wall()
fi: outo WallHitType (%d) thing_hit_wall():ssa

source: player is not allowed to activate type %d
fi: pelaaja ei saa aktivoida tyyppiä %d

source: non-player is not allowed to activate type %d
fi: ei-pelaaja ei saa aktivoida tyyppiä %d

source: YOU NEED A KEY!
fi: TARVITSET AVAIMEN!

source: line %d is having something done to it by thing %d
fi: olio %2$d tekee jotain viivalle %1$d

source: tried manual action on wall with no back?
fi: yritettiin manual-toimintaa seinälle, jolla ei ole takapuolta?

source: tried manual_f action on wall with no front?
fi: yritettiin manual_f-toimintaa seinälle, jolla ei ole etupuolta?

source: strange lumptype (%d) while performing actions
fi: outo könttityyppi (%d) toimintoja suoritettaessa

source: Obj %d is heatseeking %d
fi: Olio %d hakeutuu olioon %d

source: thing %d is out to get %d!
fi: olio %d suuttui %d:lle!

source: thing %d took %d damage (%d/%d hits)
fi: olio %d kärsi %d vahinkoa (%d/%d kestopistettä)

source: melee: %d's attack on %d failed
fi: tappelu: %d:n hyökkäys %d:n kimppuun epäonnistui

source: Thing %d becomes type %d; old type was %d
fi: Olio %d muuttuu tyyppi %d:ksi; ennen tyyppi oli %d

source: UDP port to listen on
fi: kuunneltava UDP-portti

source: IP broadcast address
fi: IP-levitysosoite

source: Host-specific port numbers will be ignored when broadcasting
fi: Konekohtaiset porttinumerot eivät vaikuta levitysviestejä käytettäessä

source: Invalid port number `%s' -- assuming %d
fi: Portin numero "%s" ei kelpaa -- oletan %d

source: gethostbyname() failed for '%s': errno=%d
fi: gethostbyname() ei löytänyt konetta "%s": errno=%d

source: error (%d) in recvfrom sock=%d
fi: virhe (%d) recvfrom:ssa, sock=%d

source: data from new station (%08x)
fi: viesti uudelta asemalta (%08x)

source: error %d blocking UDP socket
fi: virhe %d säädettäessä UDP-yhdistintä pidätteleväksi

source: error (%d) in peek recvfrom sock=%d
fi: virhe (%d) kurkistus-recvfrom:ssa, sock=%d

source: error %d unblocking UDP socket
fi: virhe %d säädettäessä UDP-yhdistintä pidättelemättömäksi

source: error (%d) in sendto sock=%d
fi: virhe (%d) sendto:ssa, sock=%d

source: error (%d) in broadcast sendto sock=%d
fi: virhe (%d) levitys-sendto:ssa, sock=%d

source: error %d creating UDP socket
fi: virhe %d UDP-yhdistintä tehdessä

source: error %d binding UDP socket
fi: virhe %d UDP-yhdistintä sitoessa

source: udp: broadcast access denied (try running as root)
fi: udp: ei levitysoikeutta (kokeile ajaa roottina)

source: udp broadcast: %d packets, %d bytes, avg len %d
fi: levitys-udp: %d pakettia, %d tavua, keskipituus %d

source: udp unicast: %d packets, %d bytes, avg len %d
fi: suunnattu udp: %d pakettia, %d tavua, keskipituus %d

source: udp total: %d packets, %d bytes, avg len %d
fi: udp yhteensä: %d pakettia, %d tavua, keskipituus %d

source: copying ceiling texture from %d to %d
fi: kopioin kattokuvion sektorista %d sektoriin %d

source: copying floor texture from %d to %d
fi: kopioin lattiakuvion sektorista %d sektoriin %d

source: sector event terminated OK s=%d type=%d
fi: sektoritapahtuma päättyi hyvin, s=%d tyyppi=%d

source: do_sector_event: strange eventtype (%d)
fi: do_sector_event: outo tapahtumatyyppi (%d)

source: sector %d has no center?
fi: sektorilla %d ei ole keskipistettä?

source: do_thing_event: teleporting %d
fi: do_thing_event: olio %d teleporttaa

source: do_thing_event: strange eventtype (%d)
fi: do_thing_event: outo tapahtumatyyppi (%d)

source: do_side_event: switching %d on
fi: do_side_event: kytken %d:n päälle

source: do_side_event: switching %d off
fi: do_side_event: kytken %d:n pois

source: do_side_event: strange eventtype (%d)
fi: do_side_event: outo tapahtumatyyppi (%d)

source: No free event in insert_event(%d,%d,%d)
fi: Ei tilaa tapahtumalle insert_event(%d,%d,%d):ssä

source: event %d passed its stop date
fi: tapahtuma %d kävi vanhaksi

source: event %d entering stage %d entity %d
fi: tapahtuma %d siirtyy vaiheeseen %d, kohde %d

source: Strange lumptype %d in um_events
fi: Outo könttityyppi %d um_events:ssä

source: %d is being crushed, but not by sector %d ???
fi: joku murskaa oliota %d muttei sektori %d ???

source: climbing, factor=%d
fi: kiipeää, suhde=%d

source: allow use of XFree86's DGA extension
fi: salli XFree86:n DGA-laajennuksen käyttö

source: allow use of the MIT shared memory extension
fi: salli MIT:n Shared Memory -laajennuksen käyttö

source: synchronous I/O (for debugging)
fi: tahdistettu I/O (vianetsintään)

source: dump core on X errors (for debugging)
fi: tallenna prosessin tila X-virheen sattuessa (vianetsintään)

source: allow use of the XKeyboard extension
fi: salli XKeyboard-laajennuksen käyttö

source: grab the keyboard focus while DUMB runs
fi: omi näppäimistö kun DUMB on päällä

source: Shm Attaches=%d
fi: Yhteyksiä jaettuun muistiin = %d

source: x11_video: Can't open default display
fi: x11_video: Ei voi avata oletusnäyttöä

source: DGA viewport=%d,%d,%d
fi: DGA-näyttöalue=%d,%d,%d
