Repository: cadwal/dumb
Catalog: po/*.po
Languages: fi

source: Usage: %s --min=BRIGHTNESS <INPUT.ppm >OUTPUT.ppm Read a PPM-format picture from standard input and convert all dark pixels to R=0,G=0,B=1 which ppmtodumb recognizes as meaning transparent. Write the resulting image to standard output.
fi: Käyttö: %s --min=KIRKKAUS <SYÖTE.ppm >TULOSTE.ppm Lukee PPM-muotoisen kuvan vakiosyötteestä ja vaihtaa kaikkien tummien pikselien väriksi R=0,G=0,B=1, jonka ppmtodumb tulkitsee läpinäkyväksi. Kirjoittaa tuloksen vakiotulosteeseen.

source: -m, --min=BRIGHTNESS If a pixel is darker than BRIGHTNESS, it is made transparent. BRIGHTNESS must be an integer. Its range depends on the input data. --help Display this help and exit. --version Output version information and exit.
fi: -m, --min=KIRKKAUS Jos pikseli on KIRKKAUTTA tummempi, siitä tulee läpinäkyvä. KIRKKAUDEN on oltava kokonaisluku. Sen arvoalue riippuu syötetiedostosta. --help Näytä tämä ohje ja lopeta. --version Näytä versiotiedot ja lopeta.

source: %s: integer `%s' should be between %ld and %ld
fi: %s: luvun "%s" pitäisi olla välillä %ld - %ld

source: trouble with XGetImage
fi: XGetImage-ongelmia

source: Usage: %s [OPTION]... --character=C >OUTPUT.pgm Converts one glyph of an X font to PGM format and outputs it on stdout.
fi: Käyttö: %s [VALITSIN]... --character=M >TULOSTE.pgm Muuntaa yhden merkin X-fontista PGM-muotoon ja suoltaa sen vakiotulosteeseen.

source: -f, --font=FONT Use X font FONT, which should be quoted to protect it from the shell. The default is "-bitstream-charter-bold-r-*-*-60-*-*-*-*-*-iso8859-1". -a, --anti-alias=FACTOR Shrink the bitmap by this factor before saving it. This results in FACTOR-1 gray levels between black and white. FACTOR must be a positive integer. -d, --display=DISPLAY Connect to X server DISPLAY. -c, --character=C The character to convert. --help Display this help and exit. --version Output version information and exit.
fi: -f, --font=FONTTI Käytä X-fonttia FONTTI. Fontin nimen ympärillä pitäisi olla lainausmerkit, ettei komentotulkki yritä tulkita asteriskeja. Oletus on "-bitstream-charter-bold-r-*-*-60-*-*-*-*-*-iso8859-1". -a, --anti-alias=KERROIN Pehmennyskerroin. Jos tämä on vaikkapa 3, ohjelma pienentää bittikartan sekä X- että Y-suunnassa kolmasosaan ennen tallennusta. Pienennyksestä seuraa KERROIN-1 harmaasävyä mustan ja valkoisen väliin. -c, --character=M Muunnettava merkki. --help Näytä tämä ohje ja lopeta. --version Näytä versiotiedot ja lopeta.

source: %s: Convert one character at a time.
fi: %s: Voit muuntaa vain yhden merkin kerrallaan.

source: %s: You must use `--character=C'.
fi: %s: Määrää muunnettava merkki valitsimella "--character=C".

source: Can't open display %s
fi: Ei voi avata näyttöä %s

source: <default>
fi: <oletus>

source: %s: font `%s' does not exist
fi: %s: kirjasinlajia "%s" ei ole olemassa

source: %s: Specify only one output filename.
fi: %s: Voit valita vain yhden kohdetiedoston.

source: %s: You must specify an output filename.
fi: %s: Valitse kohdetiedosto.

source: Usage: %s [-m MAPNAME] -o FILENAME Creates a map consisting of just one 512x512x128 room and the player object.
fi: Käyttö: %s [-m KARTTA] -o TIEDOSTO Luo kartan, jossa on vain yksi 512x512x128-huone ja pelaajaolio.

source: -m, --map=MAPNAME Name of map to save in the WAD. Defaults to E1M1. -o, --output-wad=FILENAME Save the map in this file. --help Display this help and exit. --version Output version information and exit.
fi: -m, --map=KARTTA Tiedostoon tallennettavan kartan nimi. Oletus on E1M1. -o, --output-wad=TIEDOSTO Tallenna kartta tähän tiedostoon. --help Näytä tämä ohje ja lopeta. --version Näytä versiotiedot ja lopeta.

source: %s: PNAMES filename was already given
fi: %s: PNAMES-tiedosto on jo annettu

source: %s: TEXTURES filename was already given
fi: %s: TEXTURES-tiedosto on jo annettu

source: %s: PNAMES filename was not given
fi: %s: valitse PNAMES-tiedosto

source: %s: TEXTURES filename was not given
fi: %s: valitse TEXTURES-tiedosto

source: %s: too many parameters
fi: %s: liikaa parametreja

source: Usage: %s [-d] -p PNAMES -t TEXTURES [SOURCE] Compiles metatexture information from SOURCE to PNAMES and TEXTURES lumps used by DUMB. SOURCE defaults to standard input.
fi: Käyttö: %s [-d] -p PNAMES -t TEXTURES [SYÖTE] Kääntää metakuviotiedot DUMB:n käyttämiksi PNAMES- ja TEXTURE1-könteiksi. Jos SYÖTETTÄ ei määrätä, ohjelma lukee tiedot vakiosyötteestä.

source: -d, --debug print debugging info -p, --output-pnames=PNAMES write the pnames lump to the file PNAMES -t, --output-textures=TEXTURES write the textures lump to the file TEXTURES --help display this help and exit --version output version information and exit
fi: -d, --debug tulosta virheenetsintätietoja -p, --output-pnames=PNAMES tallenna pnames-köntti tiedostoon PNAMES -t, --output-textures=TEXTURES tallenna textures-köntti tiedostoon TEXTURES --help näytä tämä ohje ja lopeta --version näytä versiotiedot ja lopeta

source: The input consists of entries such as the following (from dumb-game-0.13.1):
fi: Syöte koostuu seuraavanlaisista osista (kopioitu dumb-game-0.13.1:stä):

source: %s:%d: patch with no texture (ignored)
fi: %s:%d: osakuvio ei kuulu mihinkään kuvioon (ohitettu)

source: %s:%d: syntax error (ignoring)
fi: %s:%d: syntaksivirhe (ohitetaan)

source: %s: %ld pnames, %d textures
fi: %s: %ld nimeä, %d kuviota

source: %s: invalid bytes-per-pixel value `%s'; must be 1, 2 or 4
fi: %s: virheellinen tavuja pikselissä -arvo "%s"; pitää olla 1, 2 tai 4

source: %s: You must specify one of the `-fpPmc' options
fi: %s: Anna yksi valitsimista "-fpPmc"

source: %s: You may not specify more than one `-fpPmc' option
fi: %s: Saat antaa vain yhden valitsimista "-fpPmc"

source: %s: Only one bytes-per-pixel number is allowed
fi: %s: Olet jo valinnut tavujen määrän pikselissä

source: Usage: %s [OPTION]... <INPUT.ppm >OUTPUT.lump Converts graphic files from the portable pixmap format (PPM) to DUMB's internal formats.
fi: Käyttö: %s [VALITSIN]... <SYÖTE.ppm >TULOSTE.lump Muuntaa kuvia Portable Pixmap (PPM) -muodosta DUMB:n omiin muotoihin.

source: -f, --flat create a 64x64 flat-format graphic -p, --patch create a transparent patch -P, --opaque-patch create a non-transparent patch -m, --playpal create a playpal -c, --colormap create a colormap -M, --use-playpal=PLAYPAL read the playpal data from PLAYPAL (default: %s) --bytes-per-pixel=NUMBER how many bytes per pixel: 1 (default), 2 or 4 -2 same as --pixel-bytes=2 -4 same as --pixel-bytes=4 -i, --id-compatible turn on id compatibility --help display this help and exit --version output version information and exit
fi: -f, --flat tee 64x64-kokoinen tasokuvio -p, --patch tee reikäinen osakuvio -P, --opaque-patch tee yhtenäinen osakuvio -m, --playpal tee paletti -c, --colormap tee värikartta -M, --use-playpal=PLAYPAL lue paletti PLAYPAL:sta (oletus: %s) --bytes-per-pixel=LUKU montako tavua pikselissä: 1 (oletus), 2 tai 4 -2 sama kuin --pixel-bytes=2 -4 sama kuin --pixel-bytes=4 -i, --id-compatible id-yhteensopivuus päälle --help näytä tämä ohje ja lopeta --version näytä versiotiedot ja lopeta

source: %s: out of memory
fi: %s: muisti loppui

source: bad ppm
fi: virheellinen ppm

source: this ppm is the wrong size for a flat
fi: tämä ppm on väärän kokoinen tasokuvioksi

source: Usage: %s [OPTION FILE [FILE]...]... Extract, copy and concatenate WAD files.
fi: Käyttö: %s [VALITSIN TIEDOSTO [TIEDOSTO]...]... Pura, kopioi ja kokoa WAD-tiedostoja.

source: -r, --read-iwad=FILE read this file as an IWAD -p, --read-pwad=FILE [FILE]... read these files as PWADs -w, --output-pwad=FILE start writing output to this PWAD -W, --output-iwad=FILE start writing output to this IWAD -D, --output-directory=DIRECTORY start writing output to this directory -c, --copy-wad=FILE [FILE]... copy all lumps in these wadfiles (without patching) -l, --copy-lump=LUMP [LUMP]... copy these lumps to the current wad -L, --empty-lump=LUMP [LUMP]... spit out an empty lump -x, --extract-lump=LUMP [LUMP]... copy these lumps to raw files -f, --read-lump=FILE [FILE]... copy raw files to lumps (guessing lump names) -F, --append-lump=FILE [FILE]... copy raw files to lump (adding to current) -n, --rename-lump OLD NEW copy lump OLD to lump NEW --help display this help and exit --version output version information and exit
fi: -r, --read-iwad=TIEDOSTO lue tiedosto IWAD:na -p, --read-pwad=TIEDOSTO [TIEDOSTO]... lue nämä tiedostot PWAD:eina -w, --output-pwad=TIEDOSTO ala kirjoittaa tätä PWAD:ia -W, --output-iwad=TIEDOSTO ala kirjoittaa tätä IWAD:ia -D, --output-directory=HAKEMISTO ala kirjoittaa tähän hakemistoon -c, --copy-wad=TIEDOSTO [TIEDOSTO]... kopioi kaikki köntit näistä WAD- tiedostoista (yhdistelemättä) -l, --copy-lump=KÖNTTI [KÖNTTI]... kopioi nämä köntit nykyiseen kohteeseen -L, --empty-lump=KÖNTTI [KÖNTTI]... kyhää tyhjä köntti -x, --extract-lump=KÖNTTI [KÖNTTI]... kopioi nämä köntit tiedostoiksi -f, --read-lump=TIEDOSTO [TIEDOSTO]... kopioi tiedostot sopivan nimisiksi könteiksi -F, --append-lump=TIEDOSTO [TIEDOSTO]... kopioi tiedostot edellisen köntin jatkoksi -n, --rename-lump VANHA UUSI kopioi VANHA köntti UUDEN nimiseksi --help näytä tämä ohje ja lopeta --version näytä versiotiedot ja lopeta

source: Usage: wadtool <option> <file> <file>... <option> <file>... Options: -r <wadfile> : read this file as an IWAD -p <wadfile> : read these files as PWADs -w <wadfile> : start writing output to this PWAD -W <wadfile> : start writing output to this IWAD -D <dir> : start writing output to this directory -c <wadfile> : copy all lumps in this wadfile (without patching) -l <lump> : copy these lumps to the current wad -L <lump> : spit out an empty lump -x <lump> : copy these lumps to raw files -f <rawfile> : copy raw file to lump (guessing lumpname) -F <rawfile> : copy raw file to lump (adding to current) -n <s> <d> : copy lump 's' to lump 'd'
fi: Käyttö: wadtool <valitsin> <tiedosto> <tiedosto>... <valitsin> <tiedosto>... Valitsimet: -r <wadtiedosto> : lue tämä tiedosto IWAD:na -p <wadtiedosto> : lue nämä tiedostot PWAD:eina -w <wadtiedosto> : ala kirjoittaa tätä PWAD:ia -W <wadtiedosto> : ala kirjoittaa tätä IWAD:ia -D <hakemisto> : ala kirjoittaa tähän hakemistoon -c <wadtiedosto> : kopioi kaikki tämän tiedoston köntit (yhdistelemättä) -l <köntti> : kopioi nämä köntit valittuun wadiin -L <köntti> : tee tyhjä köntti -x <köntti> : kopioi nämä köntit paljaisiin tiedostoihin -f <paljas tiedosto>: kopioi köntiksi (sopivan nimiseksi) -F <paljas tiedosto>: kopioi könttiin (äskeisen jatkoksi) -n <l> <k> : kopioi köntti "l" köntiksi "k"

source: copying *(%s) -> %s(%s)
fi: kopioin *(%s) -> %s(%s)

source: copying %s -> %s(%s)
fi: kopioin %s -> %s(%s)

source: copying *(%s) -> %s(%s)
fi: kopioin *(%s) -> %s(%s)

source: copying *(%s) -> %s
fi: kopioin *(%s) -> %s

source: You must select exactly two lines.
fi: Sinun pitää valita tasan kaksi janaa.

source: Lines don't cross.
fi: Janat eivät leikkaa toisiaan.

source: first vertex is %d, angle %f
fi: ensimmäinen nurkka on %d, kulma %f

source: vertex %d, angle is %f
fi: nurkka %d, kulma on %f

source: connecting %d -> %d
fi: yhdistän %d -> %d

source: %d and %d are already connected
fi: %d ja %d ovat jo yhdessä

source: No vertices were connected.
fi: Nurkkapisteitä ei yhdistetty.

source: Some vertices were not connected.
fi: Joitakin nurkkapisteitä jäi yli.

source: There must be exactly two lines connected to the selected vertex.
fi: Valittuun nurkkaan pitää johtaa tasan kaksi janaa.

source: You must select two one-sided sector boundaries.
fi: Sinun pitää valita kaksi sektorin ulkoseinää.

source: Sector does not seem corridor-like.
fi: Sektori ei vaikuta käytävältä.

source: No Create function for this mode yet!
fi: Näitä ei vielä voi tehdä!

source: Flat
fi: Taso

source: Wall
fi: Seinä

source: Patch
fi: Osa

source: Texture Browser
fi: kuvion valinta

source: Cancel
fi: Peruuta

source: Preview
fi: Esikatselu

source: RotState:
fi: Pyöritys:

source: Rotate
fi: Pyöritä

source: Advance
fi: Askel

source: Phase:
fi: Vaihe:

source: Animate
fi: Animoi

source: SpriteSize:
fi: Spriten koko:

source: Init
fi: Alku

source: Detect
fi: Havainto

source: Fight
fi: Hyökkäys

source: Special
fi: Erikoinen

source: Ouch
fi: Auh

source: Die
fi: Kuolema

source: Explode
fi: Räjähdys

source: Usage: %s [OPTION]... Interactively view ProtoThings in X11.
fi: Käyttö: %s [VALITSIN]... Katsele protothingejä X11:ssä.

source: -w, --load-wad=FILE load FILE as a WAD -s, --no-sound don't try to play sounds -d, --display=DISPLAY use X display DISPLAY -l, --log-to=FILE save messages to FILE -v, --verbose log to the screen --help display this help and exit --version output version information and exit
fi: -w, --load-wad=TIEDOSTO lataa WAD-muotoinen TIEDOSTO -s, --no-sound älä soita ääniä -d, --display=NÄYTTÖ ota yhteys X-palvelimeen NÄYTTÖ -l, --log-to=TIEDOSTO kirjaa viestit TIEDOSTOON -v, --verbose näytä viestit ruudulla --help näytä tämä ohje ja lopeta --version näytä versiotiedot ja lopeta

source: %s: internal limit on wad files exceeded
fi: %s: enemmän wad-tiedostoja kuin ohjelma jaksaa käsitellä

source: no PROTOS lump in wad
fi: ei PROTOS-könttiä wadissa

source: no protos
fi: ei protoja

source: Level Saved.
fi: Kenttä tallennettu.

source: Usage: %s [OPTION]... Interactively edit DUMB levels in X11.
fi: Käyttö: %s [VALITSIN]... Muokkaa DUMB-kenttiä X11:ssä.

source: -w, --load-wad=FILE load FILE as a WAD -m, --map=MAPNAME start editing map MAPNAME (default E1M1) -d, --display=DISPLAY use X display DISPLAY -l, --log-to=FILE save messages to FILE -v, --verbose log to the screen --help display this help and exit --version output version information and exit
fi: -w, --load-wad=TIEDOSTO lataa WAD-muotoinen TIEDOSTO -m, --map=KARTTA muokkaa tämän nimistä karttaa (oletus E1M1) -d, --display=NÄYTTÖ ota yhteys X-palvelimeen NÄYTTÖ -l, --log-to=TIEDOSTO kirjaa viestit TIEDOSTOON -v, --verbose näytä viestit ruudulla --help näytä tämä ohje ja lopeta --version näytä versiotiedot ja lopeta

source: BigMap
fi: Koko ikkuna

source: VerMode
fi: Nurkat

source: Load:
fi: Lataa:

source: LineMode
fi: Janat

source: Save As:
fi: Tallenna:

source: SectMode
fi: Sektorit

source: Prev
fi: Edellinen

source: Next
fi: Seuraava

source: ThingMode
fi: Oliot

source: Grid:
fi: Ruudukko:

source: Sprites
fi: Spritet

source: Zoom In
fi: Suurenna

source: Zoom Out
fi: Pienennä

source: Scale:
fi: Mittakaava:

source: Vertex #
fi: Nurkka #

source: X-coord
fi: X-koord.

source: Y-coord
fi: Y-koord.

source: Connect
fi: Yhdistä

source: CCW
fi: Vastapäiv.

source: JoinLines
fi: Saumaa

source: Sect #
fi: Sekt. #

source: FloorLvl
fi: Lattiataso

source: CeilingLvl
fi: Kattotaso

source: Floor
fi: Lattia

source: Ceiling
fi: Katto

source: Light
fi: Valo

source: Type
fi: Tyyppi

source: Tag
fi: Tunnus

source: Stairs
fi: Portaat

source: BigStairs
fi: Isot port.

source: Thing #
fi: Olio #

source: Easy
fi: Helppo

source: Delete
fi: Poista

source: Medium
fi: Keski

source: Multi
fi: Moninpeli

source: Hard
fi: Vaikea

source: Deaf
fi: Kuuro

source: Angle
fi: Kulma

source: Line #
fi: Jana #

source: VerFlip
fi: <-> nurkat

source: SideFlip
fi: <-> kyljet

source: Impassible
fi: Este

source: TwoSided
fi: 2-puolinen

source: M-Impass
fi: Petoeste

source: UnpUpper
fi: Yläp. irti

source: UnpLower
fi: Alap. irti

source: Secret
fi: Salainen

source: BlockSnd
fi: Äänieriste

source: NoMap
fi: Ei kartassa

source: ForceMap
fi: Aina kart.

source: Poster
fi: Juliste

source: Crossing
fi: Leikkaus

source: Split
fi: Puolita

source: MkSector
fi: Tee sektori

source: Corridor
fi: Käytävä

source: Side #
fi: Kylki #

source: Sector #
fi: Sektori #

source: Offset
fi: Siirros

source: Texture
fi: Kuvio

source: U-Texture
fi: Yläkuvio

source: L-Texture
fi: Alakuvio
